-- lua/options.lua

local opt = vim.opt

--==============================================================================
-- Editor Behavior
--==============================================================================

-- 行番号を表示する
opt.number = true
-- 相対行番号を表示する (<N>j, <N>kでの移動が楽になる)
opt.relativenumber = true

-- 無名レジスタとシステムクリップボードを同期させる
opt.clipboard = 'unnamedplus'

-- Tabキー押下でタブ文字の代わりにスペースを挿入するか
opt.expandtab = true
-- タブ文字をスペース何個分で表示するか
opt.tabstop = 4
-- インデントの深さを定義する
opt.shiftwidth = 4
-- Tabキー押下時の挙動。指定の数までスペースで埋める
-- この数で1つのインデントブロックを定義する
-- Backspaceで1度にまとめて削除される
opt.softtabstop = 4

--==============================================================================
-- Visualize Invisible Characters
--==============================================================================

-- 不可視文字の表示を有効にする
opt.list = true

opt.listchars = {
  tab = '▸ ', -- タブを矢印記号とスペースで表示
  trail = '·', -- 行末の不要なスペースを点で表示
  nbsp = '¬', -- ノーブレークスペース
  extends = '»', -- 折り返し行の行末を示す
  precedes = '«', -- 折り返し行の行頭を示す
}
