-- lua/options.lua

local opt = vim.opt

--==============================================================================
-- Editor Behavior
--==============================================================================

-- 行番号を表示する
opt.number = true
-- 相対行番号を表示する (<N>j, <N>kでの移動が楽になる)
opt.relativenumber = true

-- カーソルがある行をハイライトする
opt.cursorline = true

-- 無名レジスタとシステムクリップボードを同期させる
opt.clipboard = 'unnamedplus'

-- Tabキー押下でタブ文字の代わりにスペースを挿入するか
opt.expandtab = true
-- タブ文字をスペース何個分で表示するか
opt.tabstop = 4
-- インデントの深さを定義する
opt.shiftwidth = 4
-- Tabキー押下時の挙動。指定の数までスペースで埋める
-- この数で1つのインデントブロックを定義する
-- Backspaceで1度にまとめて削除される
opt.softtabstop = 4

-------------------------------------------------------------------------------
-- Search Behavior
-------------------------------------------------------------------------------
-- 検索時に大文字と小文字を区別しない
opt.ignorecase = true
-- 検索パターンに大文字が含まれている場合は区別する
opt.smartcase = true

-------------------------------------------------------------------------------
-- UI / UX
-------------------------------------------------------------------------------
-- ターミナルでTrue Colorを有効にする
opt.termguicolors = true

-- カーソル行が常に画面の上から8行目、下から8行目に表示されるようにスクロールする
opt.scrolloff = 8
opt.sidescrolloff = 8

-- lintやgitのサインを表示する列を常に確保する (テキストがガタつくのを防ぐ)
opt.signcolumn = 'yes'

-- 100桁目に縦線を引く
opt.colorcolumn = '100'

-------------------------------------------------------------------------------
-- Window Management
-------------------------------------------------------------------------------
-- 新しいウィンドウを右側や下側に開くようにする
opt.splitright = true
opt.splitbelow = true

-------------------------------------------------------------------------------
-- Performance / Responsiveness
-------------------------------------------------------------------------------
-- キーマッピングの入力待機時間を300ミリ秒に設定 (デフォルトは1000msで長い)
opt.timeoutlen = 300

-- git gutterなどのプラグインの更新間隔 (ミリ秒)
opt.updatetime = 300

-------------------------------------------------------------------------------
-- File Management
-------------------------------------------------------------------------------
-- 編集中にバックアップファイルを作成しない
opt.backup = false
opt.writebackup = false

--==============================================================================
-- File Saving / History
--==============================================================================

-- Neovimの標準データディレクトリを取得
local data_dir = vim.fn.stdpath('data')

-------------------------------------------------------------------------------
-- Undo / History Settings
-------------------------------------------------------------------------------
-- undo履歴を有効にする
vim.opt.undofile = true

-- undo履歴を保存するディレクトリのパスを定義
local undo_dir = data_dir .. '/undodir'
vim.opt.undodir = undo_dir

-- undoディレクトリがなければ作成する
if vim.fn.isdirectory(undo_dir) == 0 then
  vim.fn.mkdir(undo_dir, 'p')
end

-------------------------------------------------------------------------------
-- Swap File Settings
-------------------------------------------------------------------------------
-- スワップファイルを有効にする
vim.opt.swapfile = true

-- スワップファイルを保存するディレクトリのパスを定義
local swap_dir = data_dir .. '/swap'
vim.opt.directory = swap_dir .. '//'

-- スワップディレクトリがなければ作成する
if vim.fn.isdirectory(swap_dir) == 0 then
  vim.fn.mkdir(swap_dir, 'p')
end

--==============================================================================
-- Visualize Invisible Characters
--==============================================================================

-- 不可視文字の表示を有効にする
opt.list = true

opt.listchars = {
  tab = '▸ ', -- タブを矢印記号とスペースで表示
  trail = '·', -- 行末の不要なスペースを点で表示
  nbsp = '¬', -- ノーブレークスペース
  extends = '»', -- 折り返し行の行末を示す
  precedes = '«', -- 折り返し行の行頭を示す
}
